[
    {
        "id": 1,
        "name": "Laura Adams",
        "title": "Selling a car on Kijiji - Tips needed!",
        "comment": "Hi everyone! I'm planning to sell my car on Kijiji, but I'm a bit nervous about the process. Any tips or advice on how to create an effective listing and deal with potential buyers? Thanks in advance!",
        "timestamp": 1644996000000,
        "likes": 12,
        "replies": [
            {
                "name": "Michael Johnson",
                "reply": "Hey Laura, I've sold a few cars on Kijiji before. Make sure to take clear and high-quality photos of your car from different angles. Be honest about its condition and any issues it may have. Also, set a realistic price and be prepared to negotiate. Lastly, meet potential buyers in a public place and trust your instincts. Good luck with the sale!",
                "timestamp": "1645028000000",
                "likes": 3
            },
            {
                "name": "Sophia Carter",
                "reply": "Laura, another tip is to write a detailed description of your car, highlighting its key features and any recent maintenance or upgrades. Also, consider promoting your ad to reach more potential buyers. Best of luck with your sale!",
                "timestamp": "1645040000000",
                "likes": 2
            }
        ]
    },
    {
        "id": 2,
        "name": "Daniel Brown",
        "title": "Tips for Selling a Used Car on Kijiji?",
        "comment": "Hi everyone, I'm looking for some advice on selling my used car on Kijiji. It's my first time doing this, and I'm not sure where to start. Any tips on creating a compelling ad and dealing with potential buyers would be greatly appreciated. Thanks!",
        "timestamp": 1645070400000,
        "likes": 8,
        "replies": [
            {
                "name": "Sophie Clark",
                "reply": "Hi Daniel, I've sold a few cars on Kijiji in the past. Make sure to include all relevant details about your car in the ad, such as make, model, year, mileage, and any recent maintenance or repairs. Take clear photos of both the interior and exterior. Also, be responsive to inquiries and be prepared to negotiate. Lastly, meet potential buyers in a safe and public location. Good luck with your sale!",
                "timestamp": "1645092000000",
                "likes": 2
            }
        ]
    },
    {
        "id": 3,
        "name": "Ryan Patel",
        "title": "Experiences Selling Cars on Kijiji?",
        "comment": "Hey folks, I'm curious to hear about your experiences selling cars on Kijiji. What worked well for you, and what challenges did you face? Any tips or insights would be helpful as I prepare to sell my car on the platform. Thanks!",
        "timestamp": 1645132800000,
        "likes": 5,
        "replies": [
            {
                "name": "Emma Wilson",
                "reply": "Hi Ryan, I've sold a couple of cars on Kijiji. One tip is to be as detailed as possible in your listing, including all relevant information about the car's condition, features, and history. Respond promptly to inquiries and be willing to negotiate. Also, be cautious of potential scams and only accept payment in a secure manner. Overall, it can be a good platform to sell your car if you approach it carefully. Good luck!",
                "timestamp": "1645154400000",
                "likes": 1
            },
            {
                "name": "Mark Thompson",
                "reply": "Ryan, one challenge I faced was dealing with lowball offers. Don't be afraid to stand your ground and wait for the right buyer. It's also a good idea to set a firm price range in your mind before negotiating. Best of luck!",
                "timestamp": "1645166400000",
                "likes": 0
            },
            {
                "name": "Olivia White",
                "reply": "Ryan, I found that including a video walkthrough of the car in my ad helped attract more serious buyers. It gives them a better sense of the car's condition and features. Just make sure the video is clear and well-lit. Hope this helps!",
                "timestamp": "1645178400000",
                "likes": 0
            }
        ]
    }
]